{
  "_common": {
    "apply": "Áp dụng",
    "auto": "Tự động",
    "autodetect": "Tự động phát hiện (khuyên dùng)",
    "beta": "(beta)",
    "cancel": "Hủy",
    "cmd_name": "Tên Lệnh",
    "cmd_val": "Giá Trị Lệnh",
    "default": "Mặc định",
    "default_global": "Mặc định (Toàn cục)",
    "disabled": "Đã tắt",
    "disabled_def": "Đã tắt (mặc định)",
    "disabled_def_cbox": "Mặc định: chưa chọn",
    "dismiss": "Bỏ qua",
    "do_cmd": "Thực hiện Lệnh",
    "elevated": "Nâng cao",
    "enabled": "Đã bật",
    "enabled_def": "Đã bật (mặc định)",
    "enabled_def_cbox": "Mặc định: đã chọn",
    "error": "Lỗi!",
    "learn_more": "Tìm hiểu thêm",
    "note": "Lưu ý:",
    "password": "Mật khẩu",
    "run_as": "Chạy với quyền Admin",
    "save": "Lưu",
    "see_more": "Xem thêm",
    "success": "Thành công!",
    "undo_cmd": "Hoàn tác Lệnh",
    "username": "Tên người dùng",
    "warning": "Cảnh báo!"
  },
  "apps": {
    "actions": "Hành động",
    "add_cmds": "Thêm Lệnh",
    "add_new": "Thêm mới",
    "allow_client_commands": "Cho phép lệnh chuẩn bị của client",
    "allow_client_commands_desc": "Có thực thi các lệnh chuẩn bị của client khi chạy ứng dụng này hay không.",
    "alphabetize": "Sắp xếp theo thứ tự bảng chữ cái",
    "already_ordered": "Các ứng dụng đã được sắp xếp theo thứ tự bảng chữ cái.",
    "app_name": "Tên Ứng dụng",
    "app_name_desc": "Tên ứng dụng, như hiển thị trên Moonlight",
    "applications_desc": "Các ứng dụng được làm mới khi một phiên bị chấm dứt.",
    "applications_reorder_desc": "Kéo và thả ứng dụng để sắp xếp lại. Mọi thay đổi sẽ chấm dứt ứng dụng đang chạy hiện tại.",
    "applications_tips": "Mẹo: Bạn cũng có thể nhấp chuột phải vào nút khởi chạy ứng dụng để sao chép liên kết khởi chạy, và gửi cho bạn bè. Họ cần sử dụng Artemis và đã ghép nối với bạn.\nBạn cũng có thể nhấp đúp vào tên ứng dụng để xuất mục ứng dụng ra tệp, để thêm chúng vào các giao diện trình giả lập yêu thích của bạn.",
    "applications_title": "Ứng dụng",
    "auto_detach": "Tiếp tục phát trực tuyến nếu ứng dụng thoát nhanh",
    "auto_detach_desc": "Điều này sẽ cố gắng tự động phát hiện các ứng dụng kiểu trình khởi chạy đóng nhanh sau khi khởi chạy một chương trình hoặc phiên bản khác của chính chúng. Khi một ứng dụng kiểu trình khởi chạy được phát hiện, nó được coi là một ứng dụng tách rời.",
    "close": "Chấm dứt",
    "close_warning": "Bạn có chắc chắn muốn chấm dứt ứng dụng đang chạy hiện tại không?",
    "close_failed": "Chấm dứt ứng dụng thất bại.",
    "cmd": "Lệnh",
    "cmd_desc": "Ứng dụng chính để khởi động. Nếu để trống, không ứng dụng nào sẽ được khởi động.",
    "cmd_note": "Nếu đường dẫn đến tệp thực thi lệnh chứa dấu cách, bạn phải đặt nó trong dấu ngoặc kép.",
    "cmd_prep_desc": "Danh sách các lệnh sẽ được chạy trước/sau ứng dụng này. Nếu bất kỳ lệnh chuẩn bị nào thất bại, việc khởi động ứng dụng sẽ bị hủy bỏ.",
    "cmd_prep_name": "Chuẩn bị Lệnh",
    "cmd_state_desc": "Danh sách các lệnh sẽ được chạy khi tiếp tục (client đầu tiên kết nối khi không có client nào được kết nối) hoặc tạm dừng (tất cả client ngắt kết nối) ứng dụng này.\nThực hiện lệnh để tiếp tục và hoàn tác lệnh để tạm dừng.\nHãy đảm bảo dọn dẹp mọi tác dụng phụ của các lệnh trong lệnh hoàn tác chuẩn bị.\nXin lưu ý rằng lệnh tạm dừng sẽ không được thực thi khi phiên bị chấm dứt.",
    "cmd_state_name": "Lệnh Tiếp tục/Tạm dừng",
    "covers_found": "Tìm thấy Ảnh bìa",
    "delete": "Xóa",
    "delete_failed": "Xóa ứng dụng thất bại: ",
    "detached_cmds": "Lệnh tách rời",
    "detached_cmds_add": "Thêm lệnh tách rời",
    "detached_cmds_desc": "Danh sách các lệnh sẽ được chạy trong nền.",
    "detached_cmds_note": "Nếu đường dẫn đến tệp thực thi lệnh chứa dấu cách, bạn phải đặt nó trong dấu ngoặc kép.",
    "edit": "Chỉnh sửa",
    "env_app_id": "ID Ứng dụng (cũ)",
    "env_app_name": "Tên Ứng dụng",
    "env_app_uuid": "UUID Ứng dụng",
    "env_app_status": "Trạng thái Ứng dụng: Một trong các giá trị 'STARTING', 'RUNNING', 'PAUSING', 'RESUMING', 'TERMINATING' (chuỗi)",
    "env_client_audio_config": "Cấu hình Âm thanh được client yêu cầu (2.0/5.1/7.1)",
    "env_client_enable_sops": "Client đã yêu cầu tùy chọn tối ưu hóa trò chơi để phát trực tuyến tối ưu (true/false)",
    "env_client_fps": "Tốc độ khung hình (FPS) được client yêu cầu (số thập phân)",
    "env_client_gcmap": "Mặt nạ gamepad được yêu cầu, ở định dạng bitset/bitfield (số nguyên)",
    "env_client_hdr": "HDR được bật bởi client (true/false)",
    "env_client_height": "Chiều cao được client yêu cầu (số nguyên)",
    "env_client_host_audio": "Client đã yêu cầu âm thanh host (true/false)",
    "env_client_width": "Chiều rộng được client yêu cầu (số nguyên)",
    "env_client_uuid": "UUID của client bắt đầu phiên phát trực tuyến (chuỗi)",
    "env_client_name": "Tên của client bắt đầu phiên phát trực tuyến (chuỗi)",
    "env_displayplacer_example": "Ví dụ - displayplacer để Tự động hóa độ phân giải:",
    "env_qres_example": "Ví dụ - QRes để Tự động hóa độ phân giải:",
    "env_qres_path": "đường dẫn qres",
    "env_rtss_cli_example": "Ví dụ - rtss-cli để Giới hạn FPS:",
    "env_sunshine_compatibility": "Các biến môi trường bắt đầu bằng \"SUNSHINE_\" đã bị lỗi thời nhưng vẫn được giữ lại để tương thích với các công cụ liên quan đến Sunshine. Biến SUNSHINE_CLIENT_FPS được sửa đổi thành FLOAT để hỗ trợ tốc độ làm mới phân số (đặc biệt cho Special-K), nếu tập lệnh/công cụ của bạn không thể nhận đầu vào số thập phân, hãy chuyển đến tab Nâng cao để bật \"Chế độ tương thích ENVVAR\". AQUAHOST_CLIENT_FPS luôn là kiểu FLOAT.",
    "env_var_name": "Tên Biến",
    "env_vars_about": "Giới thiệu về Biến môi trường",
    "env_vars_desc": "Tất cả các lệnh đều nhận các biến môi trường này theo mặc định:",
    "env_xrandr_example": "Ví dụ - Xrandr để Tự động hóa độ phân giải:",
    "export_launcher_file": "Xuất tệp khởi chạy",
    "exit_timeout": "Thời gian chờ thoát",
    "exit_timeout_desc": "Số giây chờ tất cả các tiến trình ứng dụng thoát một cách an toàn khi được yêu cầu đóng. Nếu không đặt, mặc định là chờ tối đa 5 giây. Nếu đặt thành 0 hoặc giá trị âm, ứng dụng sẽ bị chấm dứt ngay lập tức.",
    "find_cover": "Tìm ảnh bìa",
    "global_prep_desc": "Bật/Tắt việc thực thi các Lệnh chuẩn bị toàn cục cho ứng dụng này.",
    "global_prep_name": "Lệnh chuẩn bị toàn cục",
    "global_state_desc": "Bật/Tắt việc thực thi các Lệnh tiếp tục/tạm dừng toàn cục cho ứng dụng này.",
    "global_state_name": "Lệnh tiếp tục/tạm dừng toàn cục",
    "image": "Hình ảnh",
    "image_desc": "Đường dẫn biểu tượng/hình ảnh/ảnh ứng dụng sẽ được gửi đến client. Hình ảnh phải là tệp PNG. Nếu không đặt, AquaHost sẽ gửi hình ảnh hộp mặc định.",
    "launch": "Khởi chạy",
    "launch_local_client": "Bạn có muốn khởi chạy ứng dụng từ client cục bộ trên thiết bị này không?",
    "launch_warning": "Bạn có chắc chắn muốn khởi chạy ứng dụng này không? Điều này sẽ chấm dứt ứng dụng đang chạy hiện tại.",
    "launch_failed": "Khởi chạy ứng dụng thất bại: ",
    "loading": "Đang tải...",
    "name": "Tên",
    "output_desc": "Tệp mà đầu ra của lệnh được lưu trữ, nếu không được chỉ định, đầu ra sẽ bị bỏ qua",
    "output_name": "Đầu ra",
    "per_client_app_identity": "ID ứng dụng cho mỗi client",
    "per_client_app_identity_desc": "Phân tách ID ứng dụng cho mỗi client. Hữu ích khi bạn muốn các cấu hình hiển thị ảo khác nhau trên ứng dụng cụ thể này cho các client khác nhau",
    "reorder_failed": "Sắp xếp lại ứng dụng thất bại: ",
    "resolution_scale_factor": "Hệ số tỉ lệ độ phân giải",
    "resolution_scale_factor_desc": "Tỉ lệ độ phân giải mà client yêu cầu dựa trên hệ số này. Ví dụ: 2000x1000 với hệ số 120% sẽ trở thành 2400x1200. Ghi đè hệ số mà client yêu cầu khi số không phải là 100%. Tùy chọn này sẽ không ảnh hưởng đến độ phân giải phát trực tuyến mà client yêu cầu.",
    "run_as_desc": "Điều này có thể cần thiết cho một số ứng dụng yêu cầu quyền quản trị viên để chạy đúng cách. Có thể khiến các lược đồ URL bị lỗi.",
    "save_failed": "Lưu ứng dụng thất bại: ",
    "save_order": "Lưu thứ tự",
    "terminate_on_pause": "Chấm dứt khi tạm dừng",
    "terminate_on_pause_desc": "Chấm dứt ứng dụng khi tất cả các client bị ngắt kết nối.",
    "use_app_identity": "Sử dụng ID ứng dụng",
    "use_app_identity_desc": "Sử dụng ID riêng của ứng dụng khi tạo màn hình ảo thay vì của client. Điều này hữu ích khi bạn muốn cấu hình màn hình cho từng APP riêng biệt.",
    "virtual_display": "Luôn tạo Màn hình ảo",
    "virtual_display_desc": "Luôn tạo một màn hình ảo khi khởi động ứng dụng này, ghi đè yêu cầu của client. Hãy đảm bảo trình điều khiển SudoVDA đã được cài đặt và bật.",
    "virtual_display_primary": "Buộc Màn hình ảo làm chính",
    "virtual_display_primary_desc": "Tự động đặt màn hình ảo làm màn hình chính khi ứng dụng khởi động. Màn hình ảo sẽ luôn được đặt làm chính khi client yêu cầu sử dụng màn hình ảo. (Khuyên nên bật) [Lỗi trên Windows 11 24H2]",
    "wait_all": "Tiếp tục phát trực tuyến cho đến khi tất cả các tiến trình ứng dụng thoát",
    "wait_all_desc": "Điều này sẽ tiếp tục phát trực tuyến cho đến khi tất cả các tiến trình được khởi động bởi ứng dụng đã chấm dứt. Khi bỏ chọn, phát trực tuyến sẽ dừng khi tiến trình ứng dụng ban đầu thoát, ngay cả khi các tiến trình ứng dụng khác vẫn đang chạy.",
    "working_dir": "Thư mục làm việc",
    "working_dir_desc": "Thư mục làm việc sẽ được truyền cho tiến trình. Ví dụ, một số ứng dụng sử dụng thư mục làm việc để tìm kiếm các tệp cấu hình. Nếu không đặt, AquaHost sẽ mặc định là thư mục cha của lệnh"
  },
  "client_card": {
    "clients": "Clients",
    "clients_desc": "Các client được tinh chỉnh đặc biệt để hoạt động tốt nhất với AquaHost",
    "generic_moonlight_clients_desc": "Các client Moonlight thông thường vẫn có thể sử dụng được với AquaHost."
  },
  "config": {
    "adapter_name": "Tên Bộ điều hợp",
    "adapter_name_desc_linux_1": "Chỉ định thủ công GPU để sử dụng để chụp.",
    "adapter_name_desc_linux_2": "để tìm tất cả các thiết bị có khả năng VAAPI",
    "adapter_name_desc_linux_3": "Thay thế ``renderD129`` bằng thiết bị từ trên để liệt kê tên và khả năng của thiết bị. Để được AquaHost hỗ trợ, nó cần có tối thiểu:",
    "adapter_name_desc_windows": "Chỉ định thủ công GPU để sử dụng để chụp. Nếu không đặt, GPU sẽ được chọn tự động. Chúng tôi thực sự khuyên bạn nên để trống trường này để sử dụng lựa chọn GPU tự động! Lưu ý: GPU này phải có màn hình được kết nối và bật nguồn. Các giá trị thích hợp có thể được tìm thấy bằng lệnh sau:",
    "adapter_name_placeholder_windows": "Radeon RX 580 Series",
    "add": "Thêm",
    "address_family": "Họ địa chỉ",
    "address_family_both": "IPv4+IPv6",
    "address_family_desc": "Đặt họ địa chỉ được AquaHost sử dụng",
    "address_family_ipv4": "Chỉ IPv4",
    "always_send_scancodes": "Luôn gửi Scancodes",
    "always_send_scancodes_desc": "Gửi scancodes tăng cường khả năng tương thích với trò chơi và ứng dụng nhưng có thể dẫn đến đầu vào bàn phím không chính xác từ một số client không sử dụng bố cục bàn phím tiếng Anh Mỹ. Bật nếu đầu vào bàn phím không hoạt động ở một số ứng dụng. Tắt nếu các phím trên client tạo ra đầu vào sai trên host.",
    "amd_coder": "Bộ mã hóa AMF (H264)",
    "amd_coder_desc": "Cho phép bạn chọn mã hóa entropy để ưu tiên chất lượng hoặc tốc độ mã hóa. Chỉ H.264.",
    "amd_enforce_hrd": "Thực thi Bộ giải mã tham chiếu giả định (HRD) AMF",
    "amd_enforce_hrd_desc": "Tăng cường các ràng buộc về kiểm soát tốc độ để đáp ứng các yêu cầu của mô hình HRD. Điều này làm giảm đáng kể tràn bitrate, nhưng có thể gây ra hiện vật mã hóa hoặc giảm chất lượng trên một số card.",
    "amd_preanalysis": "Phân tích trước AMF",
    "amd_preanalysis_desc": "Điều này bật phân tích trước kiểm soát tốc độ, có thể tăng chất lượng với chi phí tăng độ trễ mã hóa.",
    "amd_quality": "Chất lượng AMF",
    "amd_quality_balanced": "cân bằng -- cân bằng (mặc định)",
    "amd_quality_desc": "Điều này kiểm soát sự cân bằng giữa tốc độ mã hóa và chất lượng.",
    "amd_quality_group": "Cài đặt chất lượng AMF",
    "amd_quality_quality": "chất lượng -- ưu tiên chất lượng",
    "amd_quality_speed": "tốc độ -- ưu tiên tốc độ",
    "amd_rc": "Kiểm soát tốc độ AMF",
    "amd_rc_cbr": "cbr -- tốc độ bit không đổi (khuyên dùng nếu HRD được bật)",
    "amd_rc_cqp": "cqp -- chế độ qp không đổi",
    "amd_rc_desc": "Điều này kiểm soát phương pháp kiểm soát tốc độ để đảm bảo chúng ta không vượt quá mục tiêu bitrate của client. 'cqp' không phù hợp để nhắm mục tiêu bitrate, và các tùy chọn khác ngoài 'vbr_latency' phụ thuộc vào Thực thi HRD để giúp hạn chế tràn bitrate.",
    "amd_rc_group": "Cài đặt Kiểm soát tốc độ AMF",
    "amd_rc_vbr_latency": "vbr_latency -- tốc độ bit biến đổi bị giới hạn độ trễ (khuyên dùng nếu HRD bị tắt; mặc định)",
    "amd_rc_vbr_peak": "vbr_peak -- tốc độ bit biến đổi bị giới hạn đỉnh",
    "amd_usage": "Sử dụng AMF",
    "amd_usage_desc": "Điều này đặt cấu hình mã hóa cơ bản. Tất cả các tùy chọn được trình bày dưới đây sẽ ghi đè một tập hợp con của cấu hình sử dụng, nhưng có các cài đặt ẩn bổ sung được áp dụng mà không thể cấu hình ở nơi khác.",
    "amd_usage_lowlatency": "độ trễ thấp - độ trễ thấp (nhanh nhất)",
    "amd_usage_lowlatency_high_quality": "độ trễ thấp_chất lượng cao - độ trễ thấp, chất lượng cao (nhanh)",
    "amd_usage_transcoding": "chuyển mã -- chuyển mã (chậm nhất)",
    "amd_usage_ultralowlatency": "siêu độ trễ thấp - siêu độ trễ thấp (nhanh nhất; mặc định)",
    "amd_usage_webcam": "webcam -- webcam (chậm)",
    "amd_vbaq": "Lượng tử hóa thích ứng dựa trên phương sai (VBAQ) AMF",
    "amd_vbaq_desc": "Hệ thống thị giác của con người thường ít nhạy cảm hơn với các hiện vật ở các khu vực có kết cấu cao. Ở chế độ VBAQ, phương sai pixel được sử dụng để chỉ ra độ phức tạp của các kết cấu không gian, cho phép bộ mã hóa phân bổ nhiều bit hơn cho các khu vực mượt mà hơn. Bật tính năng này giúp cải thiện chất lượng hình ảnh chủ quan với một số nội dung.",
    "apply_note": "Nhấp 'Áp dụng' để khởi động lại AquaHost và áp dụng các thay đổi. Thao tác này sẽ chấm dứt mọi phiên đang chạy.",
    "audio_sink": "Thiết bị đầu ra âm thanh",
    "audio_sink_desc_linux": "Tên của thiết bị đầu ra âm thanh được sử dụng cho Audio Loopback. Nếu bạn không chỉ định biến này, pulseaudio sẽ chọn thiết bị giám sát mặc định. Bạn có thể tìm thấy tên của thiết bị đầu ra âm thanh bằng một trong các lệnh sau:",
    "audio_sink_desc_macos": "Tên của thiết bị đầu ra âm thanh được sử dụng cho Audio Loopback. AquaHost chỉ có thể truy cập micrô trên macOS do các hạn chế của hệ thống. Để phát trực tuyến âm thanh hệ thống bằng Soundflower hoặc BlackHole.",
    "audio_sink_desc_windows": "Thiết bị âm thanh sẽ được sử dụng khi máy chủ cho phép xuất âm thanh bằng client.\nNếu không được đặt, thiết bị sẽ được chọn tự động.\nBạn có thể lấy ID thiết bị bằng lệnh sau:",
    "audio_sink_placeholder_macos": "BlackHole 2ch",
    "audio_sink_placeholder_windows": "Loa (Thiết bị âm thanh độ nét cao)",
    "auto_capture_sink": "Tự động thu thiết bị đầu ra hiện tại",
    "auto_capture_sink_desc": "Tự động thu thiết bị đầu ra hiện tại sau khi thiết bị đầu ra âm thanh mặc định được thay đổi.",
    "av1_mode": "Hỗ trợ AV1",
    "av1_mode_0": "AquaHost sẽ quảng cáo hỗ trợ AV1 dựa trên khả năng bộ mã hóa (khuyên dùng)",
    "av1_mode_1": "AquaHost sẽ không quảng cáo hỗ trợ AV1",
    "av1_mode_2": "AquaHost sẽ quảng cáo hỗ trợ cấu hình AV1 Main 8-bit",
    "av1_mode_3": "AquaHost sẽ quảng cáo hỗ trợ cấu hình AV1 Main 8-bit và 10-bit (HDR)",
    "av1_mode_desc": "Cho phép client yêu cầu luồng video AV1 Main 8-bit hoặc 10-bit. AV1 tốn nhiều CPU hơn để mã hóa, vì vậy việc bật tùy chọn này có thể làm giảm hiệu suất khi sử dụng mã hóa phần mềm.",
    "back_button_timeout": "Thời gian chờ mô phỏng nút Home/Guide",
    "back_button_timeout_desc": "Nếu nút Quay lại/Chọn được giữ trong số mili giây được chỉ định, một lần nhấn nút Home/Guide sẽ được mô phỏng. Nếu đặt thành giá trị < 0 (mặc định), giữ nút Quay lại/Chọn sẽ không mô phỏng nút Home/Guide.",
    "capture": "Buộc một phương pháp chụp cụ thể",
    "capture_desc": "Ở chế độ tự động, AquaHost sẽ sử dụng phương pháp hoạt động đầu tiên. NvFBC yêu cầu trình điều khiển nvidia đã được vá.",
    "cert": "Chứng chỉ",
    "cert_desc": "Chứng chỉ được sử dụng cho giao diện người dùng web và ghép nối client Moonlight. Để tương thích tốt nhất, chứng chỉ này nên có khóa công khai RSA-2048.",
    "channels": "Số client kết nối tối đa",
    "channels_desc_1": "AquaHost có thể cho phép một phiên phát trực tuyến duy nhất được chia sẻ với nhiều client cùng lúc.",
    "channels_desc_2": "Một số bộ mã hóa phần cứng có thể có những hạn chế làm giảm hiệu suất với nhiều luồng.",
    "coder_cabac": "cabac -- mã hóa số học nhị phân thích ứng theo ngữ cảnh - chất lượng cao hơn",
    "coder_cavlc": "cavlc -- mã hóa độ dài biến đổi thích ứng theo ngữ cảnh - giải mã nhanh hơn",
    "configuration": "Cấu hình",
    "controller": "Bật đầu vào Gamepad",
    "controller_desc": "Cho phép khách điều khiển hệ thống host bằng gamepad / bộ điều khiển",
    "credentials_file": "Tệp thông tin đăng nhập",
    "credentials_file_desc": "Lưu Tên người dùng/Mật khẩu riêng biệt khỏi tệp trạng thái của AquaHost.",
    "dd_config_ensure_active": "Tự động kích hoạt màn hình",
    "dd_config_ensure_only_display": "Tắt các màn hình khác và chỉ kích hoạt màn hình đã chỉ định",
    "dd_config_ensure_primary": "Tự động kích hoạt màn hình và đặt làm màn hình chính",
    "dd_config_label": "Cấu hình thiết bị",
    "dd_config_revert_delay": "Độ trễ khôi phục cấu hình",
    "dd_config_revert_delay_desc": "Thời gian trễ bổ sung tính bằng mili giây để chờ trước khi khôi phục cấu hình khi ứng dụng đã đóng hoặc phiên cuối cùng bị chấm dứt. Mục đích chính là cung cấp quá trình chuyển đổi mượt mà hơn khi nhanh chóng chuyển đổi giữa các ứng dụng.",
    "dd_config_revert_on_disconnect": "Khôi phục cấu hình khi ngắt kết nối",
    "dd_config_revert_on_disconnect_desc": "Khôi phục cấu hình khi ngắt kết nối tất cả các client thay vì đóng ứng dụng hoặc chấm dứt phiên cuối cùng.",
    "dd_config_verify_only": "Xác minh rằng màn hình đã được bật",
    "dd_hdr_option": "HDR",
    "dd_hdr_option_auto": "Tự động bật/tắt chế độ HDR theo yêu cầu của client (mặc định)",
    "dd_hdr_option_disabled": "Không thay đổi cài đặt HDR",
    "dd_mode_remapping": "Ánh xạ lại chế độ hiển thị",
    "dd_mode_remapping_add": "Thêm mục ánh xạ lại",
    "dd_mode_remapping_desc_1": "Chỉ định các mục ánh xạ lại để thay đổi độ phân giải và/hoặc tần số làm mới được yêu cầu thành các giá trị khác.",
    "dd_mode_remapping_desc_2": "Danh sách được lặp từ trên xuống dưới và kết quả khớp đầu tiên sẽ được sử dụng.",
    "dd_mode_remapping_desc_3": "Các trường \"Yêu cầu\" có thể để trống để khớp với bất kỳ giá trị nào được yêu cầu.",
    "dd_mode_remapping_desc_4_final_values_mixed": "Phải chỉ định ít nhất một trường \"Cuối cùng\". Độ phân giải hoặc tần số làm mới không được chỉ định sẽ không thay đổi.",
    "dd_mode_remapping_desc_4_final_values_non_mixed": "Trường \"Cuối cùng\" phải được chỉ định và không thể để trống.",
    "dd_mode_remapping_desc_5_sops_mixed_only": "Tùy chọn \"Tối ưu hóa cài đặt trò chơi\" phải được bật trong Moonlight client, nếu không các mục có bất kỳ trường độ phân giải nào được chỉ định sẽ bị bỏ qua.",
    "dd_mode_remapping_desc_5_sops_resolution_only": "Tùy chọn \"Tối ưu hóa cài đặt trò chơi\" phải được bật trong Moonlight client, nếu không ánh xạ sẽ bị bỏ qua.",
    "dd_mode_remapping_final_refresh_rate": "Tốc độ làm mới cuối cùng",
    "dd_mode_remapping_final_resolution": "Độ phân giải cuối cùng",
    "dd_mode_remapping_requested_fps": "FPS được yêu cầu",
    "dd_mode_remapping_requested_resolution": "Độ phân giải được yêu cầu",
    "dd_options_header": "Tùy chọn thiết bị hiển thị nâng cao",
    "dd_refresh_rate_option": "Tốc độ làm mới",
    "dd_refresh_rate_option_auto": "Sử dụng giá trị FPS do client cung cấp (mặc định)",
    "dd_refresh_rate_option_disabled": "Không thay đổi tốc độ làm mới",
    "dd_refresh_rate_option_manual": "Sử dụng tốc độ làm mới nhập thủ công",
    "dd_refresh_rate_option_manual_desc": "Nhập tốc độ làm mới sẽ được sử dụng",
    "dd_resolution_option": "Độ phân giải",
    "dd_resolution_option_auto": "Sử dụng độ phân giải do client cung cấp (mặc định)",
    "dd_resolution_option_disabled": "Không thay đổi độ phân giải",
    "dd_resolution_option_manual": "Sử dụng độ phân giải nhập thủ công",
    "dd_resolution_option_manual_desc": "Nhập độ phân giải sẽ được sử dụng",
    "dd_resolution_option_ogs_desc": "Tùy chọn \"Tối ưu hóa cài đặt trò chơi\" phải được bật trên Moonlight client để tính năng này hoạt động.",
    "dd_resolution_option_vdisplay_desc": "Khi sử dụng màn hình ảo, chỉ độ phân giải tích hợp và độ phân giải/tốc độ làm mới do client yêu cầu mới hoạt động.",
    "dd_resolution_option_multi_instance_desc": "Khi sử dụng nhiều phiên bản của AquaHost, hãy đảm bảo bạn đã tắt tùy chọn này trong tất cả các phiên bản, nếu không nó sẽ gây ra sự cố. Vẫn nên tắt phần này nếu bạn không muốn độ phân giải màn hình vật lý của mình thay đổi hoặc bạn chỉ phát trực tuyến với màn hình ảo.",
    "dd_wa_hdr_toggle_delay_desc_1": "Khi sử dụng thiết bị hiển thị ảo (VDD) để phát trực tuyến, nó có thể hiển thị màu HDR không chính xác. AquaHost có thể cố gắng khắc phục sự cố này bằng cách tắt HDR rồi bật lại.",
    "dd_wa_hdr_toggle_delay_desc_2": "Nếu giá trị được đặt thành 0, giải pháp này bị tắt (mặc định). Nếu giá trị nằm trong khoảng từ 0 đến 3000 mili giây, AquaHost sẽ tắt HDR, chờ trong khoảng thời gian được chỉ định và sau đó bật lại HDR. Thời gian trễ khuyến nghị là khoảng 500 mili giây trong hầu hết các trường hợp.",
    "dd_wa_hdr_toggle_delay_desc_3": "KHÔNG sử dụng giải pháp này trừ khi bạn thực sự gặp sự cố với HDR vì nó trực tiếp ảnh hưởng đến thời gian bắt đầu luồng!",
    "dd_wa_hdr_toggle_delay": "Khắc phục độ tương phản cao cho HDR",
    "double_refreshrate": "Tăng gấp đôi tần số làm mới cho Màn hình ảo",
    "double_refreshrate_desc": "Tăng gấp đôi tần số làm mới được yêu cầu khi tạo màn hình ảo, tần số làm mới được phát trực tuyến vẫn giữ nguyên. Có thể cải thiện vấn đề giật hình trên một số hệ thống.",
    "ds4_back_as_touchpad_click": "Ánh xạ Back/Select thành Nhấp Touchpad",
    "ds4_back_as_touchpad_click_desc": "Khi buộc giả lập DS4, ánh xạ Back/Select thành Nhấp Touchpad",
    "enable_discovery": "Bật Tự động khám phá",
    "enable_discovery_desc": "Khi tắt, bạn sẽ cần nhập thủ công IP host trên client để ghép nối.",
    "enable_input_only_mode": "Bật chế độ chỉ nhập liệu",
    "enable_input_only_mode_desc": "Thêm một mục ứng dụng Chỉ nhập liệu. Khi được bật, danh sách ứng dụng sẽ chỉ hiển thị ứng dụng đang chạy hiện tại và mục Chỉ nhập liệu khi phát trực tuyến. Mục Chỉ nhập liệu sẽ không nhận bất kỳ hình ảnh hoặc âm thanh nào. Hữu ích cho việc vận hành máy tính để bàn trên TV hoặc kết nối các thiết bị ngoại vi mà TV không hỗ trợ bằng điện thoại.",
    "enable_pairing": "Bật Ghép nối",
    "enable_pairing_desc": "Bật ghép nối cho client Moonlight. Điều này cho phép client xác thực với host và thiết lập kết nối an toàn.",
    "encoder": "Buộc một bộ mã hóa cụ thể",
    "encoder_desc": "Buộc một bộ mã hóa cụ thể, nếu không AquaHost sẽ chọn tùy chọn tốt nhất có sẵn. Lưu ý: Nếu bạn chỉ định một bộ mã hóa phần cứng trên Windows, nó phải khớp với GPU mà màn hình được kết nối.",
    "encoder_software": "Phần mềm",
    "envvar_compatibility_mode": "Chế độ tương thích ENVVAR",
    "envvar_compatibility_mode_desc": "Bật chế độ tương thích cho biến môi trường. Điều này sẽ sửa đổi hành vi của một số biến môi trường để tương thích hơn với các công cụ cũ hơn.",
    "external_ip": "IP bên ngoài",
    "external_ip_desc": "Nếu không có địa chỉ IP bên ngoài nào được cung cấp, AquaHost sẽ tự động phát hiện IP bên ngoài",
    "fallback_mode": "Chế độ hiển thị dự phòng",
    "fallback_mode_desc": "AquaHost sẽ sử dụng chế độ này khi client không cung cấp chế độ hoặc khi ứng dụng được khởi chạy thông qua giao diện người dùng web. Định dạng: [Chiều rộng]x[Chiều cao]x[FPS]",
    "fallback_mode_error": "Chế độ dự phòng không hợp lệ. Định dạng: [Chiều rộng]x[Chiều cao]x[FPS]",
    "fec_percentage": "Phần trăm FEC",
    "fec_percentage_desc": "Phần trăm các gói sửa lỗi trên mỗi gói dữ liệu trong mỗi khung video. Giá trị cao hơn có thể sửa được nhiều lỗi mất gói mạng hơn, nhưng phải trả giá bằng việc tăng mức sử dụng băng thông.",
    "ffmpeg_auto": "tự động -- để ffmpeg quyết định (mặc định)",
    "file_apps": "Tệp ứng dụng",
    "file_apps_desc": "Tệp nơi các ứng dụng hiện tại của AquaHost được lưu trữ.",
    "file_state": "Tệp trạng thái",
    "file_state_desc": "Tệp nơi trạng thái hiện tại của AquaHost được lưu trữ",
    "gamepad": "Loại gamepad mô phỏng",
    "gamepad_auto": "Tùy chọn lựa chọn tự động",
    "gamepad_desc": "Chọn loại gamepad để mô phỏng trên host",
    "gamepad_ds4": "DS4 (PS4)",
    "gamepad_ds4_manual": "Tùy chọn lựa chọn DS4",
    "gamepad_ds5": "DS5 (PS5)",
    "gamepad_switch": "Nintendo Pro (Switch)",
    "gamepad_manual": "Tùy chọn DS4 thủ công",
    "gamepad_x360": "X360 (Xbox 360)",
    "gamepad_xone": "XOne (Xbox One)",
    "global_prep_cmd": "Chuẩn bị Lệnh",
    "global_prep_cmd_desc": "Cấu hình danh sách các lệnh sẽ được thực thi trước hoặc sau khi chạy bất kỳ ứng dụng nào. Nếu bất kỳ lệnh chuẩn bị nào được chỉ định thất bại, quá trình khởi chạy ứng dụng sẽ bị hủy bỏ.",
    "global_state_cmd": "Lệnh Tiếp tục/Tạm dừng",
    "global_state_cmd_desc": "Cấu hình danh sách các lệnh sẽ được thực thi khi tiếp tục (client đầu tiên kết nối khi không có client nào được kết nối) hoặc tạm dừng (tất cả client ngắt kết nối) bất kỳ ứng dụng nào.\nThực hiện lệnh để tiếp tục và hoàn tác lệnh để tạm dừng.\nHãy đảm bảo dọn dẹp mọi tác dụng phụ của các lệnh trong lệnh hoàn tác chuẩn bị.\nXin lưu ý rằng lệnh tạm dừng sẽ không được thực thi khi phiên bị chấm dứt.",
    "headless_mode": "Chế độ không màn hình",
    "headless_mode_desc": "Khởi động AquaHost ở chế độ không màn hình. Khi được bật, tất cả các ứng dụng sẽ khởi động trong màn hình ảo.",
    "hevc_mode": "Hỗ trợ HEVC",
    "hevc_mode_0": "AquaHost sẽ quảng cáo hỗ trợ HEVC dựa trên khả năng bộ mã hóa (khuyên dùng)",
    "hevc_mode_1": "AquaHost sẽ không quảng cáo hỗ trợ HEVC",
    "hevc_mode_2": "AquaHost sẽ quảng cáo hỗ trợ cấu hình HEVC Main",
    "hevc_mode_3": "AquaHost sẽ quảng cáo hỗ trợ cấu hình HEVC Main và Main10 (HDR)",
    "hevc_mode_desc": "Cho phép client yêu cầu luồng video HEVC Main hoặc HEVC Main10. HEVC tốn nhiều CPU hơn để mã hóa, vì vậy việc bật tùy chọn này có thể làm giảm hiệu suất khi sử dụng mã hóa phần mềm.",
    "hide_tray_controls": "Ẩn các tùy chọn điều khiển khay",
    "hide_tray_controls_desc": "Không hiển thị \"Buộc dừng\", \"Khởi động lại\" và \"Thoát\" trong menu khay.",
    "high_resolution_scrolling": "Hỗ trợ cuộn độ phân giải cao",
    "high_resolution_scrolling_desc": "Khi được bật, AquaHost sẽ truyền các sự kiện cuộn độ phân giải cao từ các client Moonlight. Điều này có thể hữu ích để tắt cho các ứng dụng cũ hơn cuộn quá nhanh với các sự kiện cuộn độ phân giải cao.",
    "install_steam_audio_drivers": "Cài đặt trình điều khiển âm thanh Steam",
    "install_steam_audio_drivers_desc": "Nếu Steam được cài đặt, điều này sẽ tự động cài đặt trình điều khiển Steam Streaming Speakers để hỗ trợ âm thanh vòm 5.1/7.1 và tắt tiếng âm thanh host.",
    "isolated_virtual_display_option": "Di chuyển màn hình ảo đến góc dưới cùng bên phải của bố cục màn hình",
    "isolated_virtual_display_option_desc": "Điều này làm cho màn hình bị cô lập với tất cả các màn hình khác và giới hạn chuyển động chuột vào màn hình ảo. Điều này sắp xếp lại các màn hình sao cho tất cả các màn hình khác nằm bên trái màn hình ảo.",
    "keep_sink_default": "Giữ thiết bị đầu ra ảo làm mặc định",
    "keep_sink_default_desc": "Có buộc thiết bị đầu ra ảo đã chọn làm mặc định hay không (hiệu quả khi đầu ra âm thanh host bị tắt).",
    "key_repeat_delay": "Độ trễ lặp phím",
    "key_repeat_delay_desc": "Kiểm soát tốc độ lặp lại phím. Độ trễ ban đầu tính bằng mili giây trước khi lặp lại phím.",
    "key_repeat_frequency": "Tần số lặp phím",
    "key_repeat_frequency_desc": "Số lần phím lặp lại mỗi giây. Tùy chọn cấu hình này hỗ trợ số thập phân.",
    "key_rightalt_to_key_win": "Ánh xạ phím Right Alt thành phím Windows",
    "key_rightalt_to_key_win_desc": "Có thể bạn không thể gửi phím Windows trực tiếp từ Moonlight. Trong những trường hợp đó, có thể hữu ích khi làm cho AquaHost nghĩ rằng phím Right Alt là phím Windows",
    "keyboard": "Bật đầu vào bàn phím",
    "keyboard_desc": "Cho phép khách điều khiển hệ thống host bằng bàn phím",
    "lan_encryption_mode": "Chế độ mã hóa LAN",
    "lan_encryption_mode_1": "Đã bật cho các client được hỗ trợ",
    "lan_encryption_mode_2": "Bắt buộc cho tất cả các client",
    "lan_encryption_mode_desc": "Điều này xác định khi nào mã hóa sẽ được sử dụng khi phát trực tuyến qua mạng cục bộ của bạn. Mã hóa có thể làm giảm hiệu suất phát trực tuyến, đặc biệt trên các host và client ít mạnh mẽ hơn.",
    "legacy_ordering": "Sắp xếp ứng dụng cho các client cũ",
    "legacy_ordering_desc": "Bật cách giải quyết vấn đề sắp xếp hỗ trợ cho các client cũ. Có thể gây ra sự cố với các client hoặc tập lệnh không xử lý UTF8 đúng cách. Các client Artemis hỗ trợ điều này theo mặc định.",
    "limit_framerate": "Giới hạn tốc độ khung hình chụp",
    "limit_framerate_desc": "Giới hạn tốc độ khung hình được chụp theo tốc độ khung hình mà client yêu cầu. Có thể không chạy ở tốc độ khung hình đầy đủ nếu vsync được bật và tốc độ làm mới màn hình không khớp với tốc độ khung hình yêu cầu. Có thể gây ra độ trễ trên một số client nếu bị tắt.",
    "locale": "Ngôn ngữ",
    "locale_desc": "Ngôn ngữ được sử dụng cho giao diện người dùng của AquaHost.",
    "log_level": "Mức ghi nhật ký",
    "log_level_0": "Chi tiết",
    "log_level_1": "Gỡ lỗi",
    "log_level_2": "Thông tin",
    "log_level_3": "Cảnh báo",
    "log_level_4": "Lỗi",
    "log_level_5": "Nghiêm trọng",
    "log_level_6": "Không có",
    "log_level_desc": "Mức ghi nhật ký tối thiểu được in ra đầu ra tiêu chuẩn",
    "log_path": "Đường dẫn tệp nhật ký",
    "log_path_desc": "Tệp nơi nhật ký hiện tại của AquaHost được lưu trữ.",
    "max_bitrate": "Tốc độ bit tối đa",
    "max_bitrate_desc": "Tốc độ bit tối đa (Kbps) mà AquaHost sẽ mã hóa luồng. Nếu đặt thành 0, nó sẽ luôn sử dụng tốc độ bit mà Artemis/Moonlight yêu cầu.",
    "min_fps_factor": "Hệ số FPS tối thiểu",
    "min_fps_factor_desc": "AquaHost sẽ sử dụng hệ số này để tính toán thời gian tối thiểu giữa các khung hình. Tăng nhẹ giá trị này có thể hữu ích khi phát trực tuyến nội dung tĩnh. Giá trị cao hơn sẽ tiêu thụ nhiều băng thông hơn.",
    "min_threads": "Số luồng CPU tối thiểu",
    "min_threads_desc": "Tăng giá trị này một chút sẽ làm giảm hiệu quả mã hóa, nhưng sự đánh đổi thường đáng giá để có thể sử dụng nhiều lõi CPU hơn để mã hóa. Giá trị lý tưởng là giá trị thấp nhất có thể mã hóa đáng tin cậy ở cài đặt phát trực tuyến mong muốn trên phần cứng của bạn.",
    "misc": "Các tùy chọn khác",
    "motion_as_ds4": "Mô phỏng gamepad DS4 nếu gamepad client báo cáo có cảm biến chuyển động",
    "motion_as_ds4_desc": "Nếu bị tắt, cảm biến chuyển động sẽ không được tính đến trong quá trình chọn loại gamepad.",
    "mouse": "Bật đầu vào chuột",
    "mouse_desc": "Cho phép khách điều khiển hệ thống host bằng chuột",
    "native_pen_touch": "Hỗ trợ bút/chạm tự nhiên",
    "native_pen_touch_desc": "Khi được bật, AquaHost sẽ truyền các sự kiện bút/chạm tự nhiên từ các client Moonlight. Điều này có thể hữu ích để tắt cho các ứng dụng cũ hơn không hỗ trợ bút/chạm tự nhiên.",
    "notify_pre_releases": "Thông báo Pre-Release",
    "notify_pre_releases_desc": "Có được thông báo về các phiên bản pre-release mới của AquaHost hay không",
    "nvenc_h264_cavlc": "Ưu tiên CAVLC hơn CABAC trong H.264",
    "nvenc_h264_cavlc_desc": "Dạng mã hóa entropy đơn giản hơn. CAVLC cần thêm khoảng 10% bitrate cho cùng chất lượng. Chỉ liên quan đến các thiết bị giải mã rất cũ.",
    "nvenc_intra_refresh": "Làm mới nội bộ",
    "nvenc_intra_refresh_desc": "Bật Làm mới nội bộ để một số client hiển thị đúng cách liên tục (ví dụ: Xbox Client)",
    "nvenc_latency_over_power": "Ưu tiên độ trễ mã hóa thấp hơn so với tiết kiệm năng lượng",
    "nvenc_latency_over_power_desc": "AquaHost yêu cầu tốc độ xung nhịp GPU tối đa khi phát trực tuyến để giảm độ trễ mã hóa. Không nên tắt tùy chọn này vì điều này có thể dẫn đến độ trễ mã hóa tăng đáng kể.",
    "nvenc_opengl_vulkan_on_dxgi": "Trình bày OpenGL/Vulkan trên DXGI",
    "nvenc_opengl_vulkan_on_dxgi_desc": "AquaHost không thể chụp các chương trình OpenGL và Vulkan toàn màn hình ở tốc độ khung hình đầy đủ trừ khi chúng được trình bày trên DXGI. Đây là cài đặt toàn hệ thống sẽ được khôi phục khi chương trình AquaHost thoát.",
    "nvenc_preset": "Cài đặt sẵn hiệu suất",
    "nvenc_preset_1": "(nhanh nhất, mặc định)",
    "nvenc_preset_7": "(chậm nhất)",
    "nvenc_preset_desc": "Số lớn hơn cải thiện nén (chất lượng ở một tốc độ bit nhất định) với chi phí tăng độ trễ mã hóa. Nên thay đổi chỉ khi bị giới hạn bởi mạng hoặc bộ giải mã, nếu không hiệu ứng tương tự có thể đạt được bằng cách tăng tốc độ bit.",
    "nvenc_realtime_hags": "Sử dụng ưu tiên thời gian thực trong lập lịch GPU tăng tốc phần cứng",
    "nvenc_realtime_hags_desc": "Hiện tại, trình điều khiển NVIDIA có thể bị đóng băng trong bộ mã hóa khi HAGS được bật, ưu tiên thời gian thực được sử dụng và mức sử dụng VRAM gần tối đa. Tắt tùy chọn này sẽ giảm ưu tiên xuống cao, bỏ qua việc đóng băng với chi phí giảm hiệu suất chụp khi GPU bị tải nặng.",
    "nvenc_spatial_aq": "AQ không gian",
    "nvenc_spatial_aq_desc": "Gán giá trị QP cao hơn cho các vùng phẳng của video. Nên bật khi phát trực tuyến ở tốc độ bit thấp hơn.",
    "nvenc_spatial_aq_disabled": "Đã tắt (nhanh hơn, mặc định)",
    "nvenc_spatial_aq_enabled": "Đã bật (chậm hơn)",
    "nvenc_twopass": "Chế độ hai lần",
    "nvenc_twopass_desc": "Thêm một lần mã hóa sơ bộ. Điều này cho phép phát hiện nhiều vectơ chuyển động hơn, phân phối tốc độ bit tốt hơn trên khung hình và tuân thủ nghiêm ngặt hơn các giới hạn tốc độ bit. Không nên tắt tùy chọn này vì điều này có thể dẫn đến tình trạng vượt tốc độ bit và mất gói tin ngẫu nhiên.",
    "nvenc_twopass_disabled": "Đã tắt (nhanh nhất, không khuyến nghị)",
    "nvenc_twopass_full_res": "Độ phân giải đầy đủ (chậm hơn)",
    "nvenc_twopass_quarter_res": "Độ phân giải một phần tư (nhanh hơn, mặc định)",
    "nvenc_vbv_increase": "Tăng phần trăm VBV/HRD một khung hình",
    "nvenc_vbv_increase_desc": "Theo mặc định, AquaHost sử dụng VBV/HRD một khung hình, nghĩa là kích thước khung video đã mã hóa không được vượt quá tốc độ bit yêu cầu chia cho tốc độ khung hình yêu cầu. Nới lỏng giới hạn này có thể có lợi và hoạt động như tốc độ bit biến đổi độ trễ thấp, nhưng cũng có thể dẫn đến mất gói tin nếu mạng không có bộ đệm để xử lý các đỉnh tốc độ bit. Giá trị tối đa được chấp nhận là 400, tương ứng với giới hạn kích thước khung video đã mã hóa tăng 5 lần.",
    "origin_web_ui_allowed": "Cho phép truy cập Web UI từ nguồn gốc",
    "origin_web_ui_allowed_desc": "Nguồn gốc của địa chỉ điểm cuối từ xa không bị từ chối quyền truy cập vào Web UI",
    "origin_web_ui_allowed_lan": "Chỉ những người trong mạng LAN mới có thể truy cập Web UI",
    "origin_web_ui_allowed_pc": "Chỉ localhost mới có thể truy cập Web UI",
    "origin_web_ui_allowed_wan": "Bất kỳ ai cũng có thể truy cập Web UI",
    "output_name_desc_unix": "Trong quá trình khởi động AquaHost, bạn sẽ thấy danh sách các màn hình được phát hiện. Lưu ý: Bạn cần sử dụng giá trị id trong dấu ngoặc đơn. Dưới đây là một ví dụ; đầu ra thực tế có thể được tìm thấy trong tab Khắc phục sự cố.",
    "output_name_desc_windows": "Chỉ định thủ công ID thiết bị hiển thị để sử dụng để chụp. Nếu không đặt, màn hình chính sẽ được chụp. Lưu ý: Nếu bạn đã chỉ định một GPU ở trên, màn hình này phải được kết nối với GPU đó. Trong quá trình khởi động AquaHost, bạn sẽ thấy danh sách các màn hình được phát hiện. Dưới đây là một ví dụ; đầu ra thực tế có thể được tìm thấy trong tab Khắc phục sự cố.",
    "output_name_unix": "Số hiển thị",
    "output_name_windows": "ID thiết bị hiển thị",
    "ping_timeout": "Thời gian chờ ping",
    "ping_timeout_desc": "Thời gian chờ dữ liệu từ moonlight tính bằng mili giây trước khi tắt luồng",
    "pkey": "Khóa riêng tư",
    "pkey_desc": "Khóa riêng tư được sử dụng cho giao diện người dùng web và ghép nối client Moonlight. Để tương thích tốt nhất, khóa này nên là khóa riêng tư RSA-2048.",
    "port": "Cổng",
    "port_alert_1": "AquaHost không thể sử dụng các cổng dưới 1024!",
    "port_alert_2": "Các cổng trên 65535 không khả dụng!",
    "port_desc": "Đặt họ cổng được AquaHost sử dụng",
    "port_http_port_note": "Sử dụng cổng này để kết nối với Moonlight.",
    "port_note": "Lưu ý",
    "port_port": "Cổng",
    "port_protocol": "Giao thức",
    "port_tcp": "TCP",
    "port_udp": "UDP",
    "port_warning": "Việc để lộ Web UI ra internet là một rủi ro bảo mật! Hãy tiếp tục với rủi ro của riêng bạn!",
    "port_web_ui": "Web UI",
    "qp": "Tham số lượng tử hóa",
    "qp_desc": "Một số thiết bị có thể không hỗ trợ Tốc độ bit không đổi. Đối với các thiết bị đó, QP được sử dụng thay thế. Giá trị cao hơn có nghĩa là nén nhiều hơn, nhưng chất lượng kém hơn.",
    "qsv_coder": "Bộ mã hóa QuickSync (H264)",
    "qsv_preset": "Cài đặt trước QuickSync",
    "qsv_preset_fast": "nhanh (chất lượng thấp)",
    "qsv_preset_faster": "nhanh hơn (chất lượng thấp hơn)",
    "qsv_preset_medium": "trung bình (mặc định)",
    "qsv_preset_slow": "chậm (chất lượng tốt)",
    "qsv_preset_slower": "chậm hơn (chất lượng tốt hơn)",
    "qsv_preset_slowest": "chậm nhất (chất lượng tốt nhất)",
    "qsv_preset_veryfast": "nhanh nhất (chất lượng thấp nhất)",
    "qsv_slow_hevc": "Cho phép mã hóa HEVC chậm",
    "qsv_slow_hevc_desc": "Điều này có thể bật mã hóa HEVC trên các GPU Intel cũ hơn, với chi phí sử dụng GPU cao hơn và hiệu suất kém hơn.",
    "restart_note": "AquaHost đang khởi động lại để áp dụng các thay đổi.",
    "server_cmd": "Lệnh máy chủ",
    "server_cmd_desc": "Cấu hình danh sách các lệnh sẽ được thực thi khi được client gọi trong quá trình phát trực tuyến.",
    "stream_audio": "Truyền âm thanh",
    "stream_audio_desc": "Có truyền âm thanh hay không. Tắt tùy chọn này có thể hữu ích cho việc truyền các màn hình không đầu làm màn hình thứ hai.",
    "sunshine_name": "Tên máy chủ",
    "sunshine_name_desc": "Tên hiển thị bởi Moonlight. Nếu không được chỉ định, tên máy chủ của PC sẽ được sử dụng",
    "sw_preset": "Cài đặt sẵn SW",
    "sw_preset_desc": "Tối ưu hóa sự đánh đổi giữa tốc độ mã hóa (số khung hình được mã hóa mỗi giây) và hiệu quả nén (chất lượng trên mỗi bit trong luồng bit). Mặc định là siêu nhanh.",
    "sw_preset_fast": "nhanh",
    "sw_preset_faster": "nhanh hơn",
    "sw_preset_medium": "trung bình",
    "sw_preset_slow": "chậm",
    "sw_preset_slower": "chậm hơn",
    "sw_preset_superfast": "siêu nhanh (mặc định)",
    "sw_preset_ultrafast": "siêu nhanh",
    "sw_preset_veryfast": "rất nhanh",
    "sw_preset_veryslow": "rất chậm",
    "sw_tune": "Điều chỉnh SW",
    "sw_tune_animation": "hoạt hình -- tốt cho phim hoạt hình; sử dụng khử khối cao hơn và nhiều khung tham chiếu hơn",
    "sw_tune_desc": "Các tùy chọn điều chỉnh, được áp dụng sau cài đặt trước. Mặc định là zerolatency.",
    "sw_tune_fastdecode": "giải mã nhanh -- cho phép giải mã nhanh hơn bằng cách tắt một số bộ lọc nhất định",
    "sw_tune_film": "phim -- sử dụng cho nội dung phim chất lượng cao; giảm khử khối",
    "sw_tune_grain": "hạt -- bảo toàn cấu trúc hạt trong vật liệu phim cũ, có hạt",
    "sw_tune_stillimage": "ảnh tĩnh -- tốt cho nội dung kiểu trình chiếu",
    "sw_tune_zerolatency": "độ trễ bằng 0 -- tốt cho mã hóa nhanh và phát trực tuyến độ trễ thấp (mặc định)",
    "touchpad_as_ds4": "Mô phỏng gamepad DS4 nếu gamepad client báo cáo có touchpad",
    "touchpad_as_ds4_desc": "Nếu bị tắt, sự hiện diện của touchpad sẽ không được tính đến trong quá trình chọn loại gamepad.",
    "upnp": "UPnP",
    "upnp_desc": "Tự động cấu hình chuyển tiếp cổng để phát trực tuyến qua Internet",
    "vaapi_strict_rc_buffer": "Thực thi nghiêm ngặt giới hạn tốc độ bit khung hình cho H.264/HEVC trên GPU AMD",
    "vaapi_strict_rc_buffer_desc": "Bật tùy chọn này có thể tránh mất khung hình qua mạng trong quá trình thay đổi cảnh, nhưng chất lượng video có thể bị giảm trong quá trình chuyển động.",
    "virtual_sink": "Thiết bị đầu ra ảo",
    "virtual_sink_desc": "Thiết bị âm thanh sẽ được sử dụng khi máy chủ không cho phép xuất âm thanh bằng client.\nNếu không được đặt, thiết bị sẽ được chọn tự động.\nChúng tôi thực sự khuyên bạn nên để trống trường này để sử dụng lựa chọn thiết bị tự động!",
    "virtual_sink_placeholder": "Loa Steam Streaming",
    "vt_coder": "Bộ mã hóa VideoToolbox",
    "vt_realtime": "Mã hóa thời gian thực VideoToolbox",
    "vt_software": "Mã hóa phần mềm VideoToolbox",
    "vt_software_allowed": "Cho phép",
    "vt_software_forced": "Buộc",
    "wan_encryption_mode": "Chế độ mã hóa WAN",
    "wan_encryption_mode_1": "Đã bật cho các client được hỗ trợ (mặc định)",
    "wan_encryption_mode_2": "Bắt buộc cho tất cả các client",
    "wan_encryption_mode_desc": "Điều này xác định khi nào mã hóa sẽ được sử dụng khi phát trực tuyến qua Internet. Mã hóa có thể làm giảm hiệu suất phát trực tuyến, đặc biệt trên các host và client ít mạnh mẽ hơn."
  },
  "login": {
    "save_password": "Ghi nhớ mật khẩu"
  },
  "index": {
    "description": "AquaHost là một máy chủ phát trực tuyến trò chơi tự lưu trữ cho Moonlight.",
    "download": "Tải xuống",
    "installed_version_not_stable": "Bạn đang chạy phiên bản tiền phát hành của AquaHost. Bạn có thể gặp lỗi hoặc các vấn đề khác. Vui lòng báo cáo bất kỳ vấn đề nào bạn gặp phải. Cảm ơn bạn đã giúp AquaHost trở thành một phần mềm tốt hơn!",
    "loading_latest": "Đang tải bản phát hành mới nhất...",
    "new_pre_release": "Phiên bản Tiền phát hành mới đã có!",
    "new_stable": "Phiên bản ổn định mới đã có!",
    "startup_errors": "<b>Chú ý!</b> AquaHost đã phát hiện những lỗi này trong quá trình khởi động. Chúng tôi <b>RẤT KHUYẾN NGHỊ</b> bạn khắc phục chúng trước khi phát trực tuyến.",
    "version_dirty": "Cảm ơn bạn đã giúp AquaHost trở thành một phần mềm tốt hơn!",
    "version_latest": "Bạn đang chạy phiên bản AquaHost mới nhất",
    "welcome": "Xin chào, AquaHost!"
  },
  "navbar": {
    "applications": "Ứng dụng",
    "configuration": "Cấu hình",
    "home": "Trang chủ",
    "password": "Thay đổi mật khẩu",
    "pin": "Mã PIN",
    "theme_auto": "Tự động",
    "theme_dark": "Tối",
    "theme_light": "Sáng",
    "toggle_theme": "Chủ đề",
    "troubleshoot": "Khắc phục sự cố"
  },
  "password": {
    "confirm_password": "Xác nhận mật khẩu",
    "current_creds": "Thông tin đăng nhập hiện tại",
    "new_creds": "Thông tin đăng nhập mới",
    "new_username_desc": "Nếu không được chỉ định, tên người dùng sẽ không thay đổi",
    "password_change": "Thay đổi mật khẩu",
    "success_msg": "Mật khẩu đã được thay đổi thành công! Trang này sẽ tải lại sớm, trình duyệt của bạn sẽ yêu cầu bạn nhập thông tin đăng nhập mới."
  },
  "permissions": {
    "input_controller": "Đầu vào Bộ điều khiển",
    "input_touch": "Đầu vào cảm ứng",
    "input_pen": "Đầu vào bút",
    "input_mouse": "Đầu vào chuột",
    "input_kbd": "Đầu vào bàn phím",
    "clipboard_set": "Đặt bảng tạm",
    "clipboard_read": "Đọc bảng tạm",
    "file_upload": "Tải tệp lên",
    "file_dwnload": "Tải tệp xuống",
    "server_cmd": "Lệnh máy chủ",
    "list": "Liệt kê ứng dụng",
    "view": "Xem luồng",
    "launch": "Khởi chạy ứng dụng"
  },
  "pin": {
    "allow_client_commands": "Cho phép lệnh client",
    "allow_client_commands_desc": "Cho phép các lệnh client được thực thi khi kết nối với thiết bị này.",
    "always_use_virtual_display": "Luôn tạo màn hình ảo",
    "always_use_virtual_display_desc": "Luôn tạo một màn hình ảo khi kết nối từ thiết bị này.",
    "client_do_cmd": "Lệnh kết nối client",
    "client_do_cmd_desc": "Các lệnh sẽ được thực thi khi client kết nối. Tất cả các lệnh đều được thực thi tách rời.",
    "client_undo_cmd": "Lệnh ngắt kết nối client",
    "client_undo_cmd_desc": "Các lệnh sẽ được thực thi khi client ngắt kết nối. Tất cả các lệnh đều được thực thi tách rời.",
    "device_name": "Tùy chọn: Tên thiết bị",
    "display_mode_override": "Ghi đè chế độ hiển thị",
    "display_mode_override_desc": "AquaHost sẽ bỏ qua chế độ hiển thị mà client yêu cầu và sử dụng giá trị này để cấu hình màn hình (ảo). Để trống để tự động khớp. Định dạng: [Chiều rộng]x[Chiều cao]x[FPS]",
    "display_mode_override_error": "Chế độ ghi đè không hợp lệ. Định dạng: [Chiều rộng]x[Chiều cao]x[FPS]",
    "enable_legacy_ordering": "Bật sắp xếp cũ",
    "enable_legacy_ordering_desc": "Bật sắp xếp ứng dụng cho các client cũ. Tắt nếu client này không thể xử lý UTF8 đúng cách. Cần bật \"Sắp xếp ứng dụng cho các client cũ\" trong cài đặt Nâng cao.",
    "pair_failure": "Ghép nối thất bại: Kiểm tra xem mã PIN có được nhập đúng không",
    "pair_success": "Thành công! Vui lòng kiểm tra Moonlight để tiếp tục",
    "pair_success_check_perm": "Ghép nối thành công! Vui lòng cấp các quyền cần thiết cho client thủ công bên dưới.",
    "pin_pairing": "Ghép nối PIN",
    "send": "Gửi",
    "warning_msg": "Đảm bảo bạn có quyền truy cập vào client mà bạn đang ghép nối. Phần mềm này có thể cấp toàn quyền kiểm soát máy tính của bạn, vì vậy hãy cẩn thận!",
    "otp_pairing": "Ghép nối OTP",
    "generate_pin": "Tạo PIN",
    "otp_passphrase": "Mật khẩu một lần",
    "otp_expired": "HẾT HẠN",
    "otp_expired_msg": "OTP đã hết hạn. Vui lòng yêu cầu OTP mới.",
    "otp_success": "Yêu cầu mã PIN thành công, mã PIN có hiệu lực trong 3 phút.",
    "otp_msg": "Ghép nối OTP chỉ khả dụng cho các client Artemis mới nhất. Vui lòng sử dụng phương pháp ghép nối cũ cho các client khác.",
    "otp_pair_now": "Mã PIN đã tạo thành công, bạn có muốn ghép nối ngay bây giờ không?",
    "device_management": "Quản lý thiết bị",
    "device_management_desc": "Quản lý các thiết bị đã ghép nối và quyền của chúng.",
    "device_management_warning": "Thiết bị đã ghép nối đầu tiên sẽ có đầy đủ quyền theo mặc định. Các thiết bị mới được ghép nối khác sẽ có các quyền hạn chế được đặt theo mặc định.",
    "save_client_error": "Lỗi khi lưu client: ",
    "unpair_all": "Hủy ghép nối tất cả",
    "unpair_all_success": "Tất cả thiết bị đã được hủy ghép nối.",
    "unpair_all_error": "Lỗi khi hủy ghép nối",
    "unpair_single_no_devices": "Không có thiết bị nào được ghép nối.",
    "unpair_single_success": "Tuy nhiên, (các) thiết bị vẫn có thể đang trong một phiên hoạt động. Sử dụng nút 'Buộc đóng' ở trên để kết thúc bất kỳ phiên đang mở nào.",
    "unpair_single_unknown": "Client không xác định"
  },
  "resource_card": {
    "github_discussions": "Thảo luận trên GitHub",
    "github_wiki": "Wiki GitHub",
    "legal": "Pháp lý",
    "legal_desc": "Bằng cách tiếp tục sử dụng phần mềm này, bạn đồng ý với các điều khoản và điều kiện trong các tài liệu sau.",
    "license": "Giấy phép",
    "lizardbyte_website": "Trang web LizardByte",
    "resources": "Tài nguyên",
    "resources_desc": "Tài nguyên cho AquaHost!",
    "third_party_notice": "Thông báo của bên thứ ba"
  },
  "troubleshooting": {
    "dd_reset": "Đặt lại cài đặt thiết bị hiển thị cố định",
    "dd_reset_desc": "Nếu AquaHost bị kẹt khi cố gắng khôi phục cài đặt thiết bị hiển thị đã thay đổi, bạn có thể đặt lại cài đặt và tiến hành khôi phục trạng thái hiển thị theo cách thủ công.",
    "dd_reset_error": "Lỗi khi đặt lại cố định!",
    "dd_reset_success": "Đặt lại cố định thành công!",
    "force_close": "Buộc đóng",
    "force_close_desc": "Nếu Moonlight than phiền về một ứng dụng đang chạy, việc buộc đóng ứng dụng sẽ khắc phục sự cố. Điều này cũng sẽ tải lại danh sách ứng dụng.",
    "force_close_error": "Lỗi khi đóng ứng dụng",
    "force_close_success": "Ứng dụng đã đóng thành công!",
    "logs": "Nhật ký",
    "logs_desc": "Xem nhật ký được tải lên bởi AquaHost",
    "logs_find": "Tìm...",
    "restart_aquahost": "Khởi động lại AquaHost",
    "restart_aquahost_desc": "Nếu AquaHost không hoạt động bình thường, bạn có thể thử khởi động lại nó. Điều này sẽ chấm dứt mọi phiên đang chạy.",
    "restart_aquahost_success": "AquaHost đang khởi động lại",
    "quit_aquahost": "Thoát AquaHost",
    "quit_aquahost_desc": "Thoát AquaHost. Điều này sẽ chấm dứt mọi phiên đang chạy.",
    "quit_aquahost_success": "AquaHost đã thoát.",
    "quit_aquahost_success_ongoing": "AquaHost đang thoát...",
    "quit_aquahost_confirm": "Bạn có thực sự muốn thoát AquaHost không? Bạn sẽ không thể khởi động lại AquaHost nếu bạn không có phương pháp nào khác để vận hành máy tính của mình.",
    "troubleshooting": "Khắc phục sự cố"
  },
  "welcome": {
    "confirm_password": "Xác nhận mật khẩu",
    "create_creds": "Trước khi bắt đầu, chúng tôi cần bạn tạo một tên người dùng và mật khẩu mới để truy cập Web UI.",
    "create_creds_alert": "Thông tin đăng nhập dưới đây là cần thiết để truy cập Web UI của AquaHost. Hãy giữ chúng an toàn, vì bạn sẽ không bao giờ thấy chúng nữa!",
    "greeting": "Chào mừng đến với AquaHost!",
    "login": "Đăng nhập",
    "welcome_success": "Trang này sẽ tải lại sớm, trình duyệt của bạn sẽ yêu cầu bạn nhập thông tin đăng nhập mới",
    "login_success": "Trang này sẽ tải lại sớm."
  }
}